thypon/bowser-kernel/drivers/net/wireless/rtl8723bs/hal/hal_com_phycfg.c
	rawValue = ( u16 ) ( pHalData->MCSTxPowerLevelOriginalOffset[0][5] >> 24 ) & 0xFF;
	base = ( rawValue >> 4) * 10 + ( rawValue & 0xF );
	PHY_SetTxPowerByRateBase( pAdapter, BAND_ON_2_4G, ODM_RF_PATH_A, HT_MCS8_MCS15, RF_2TX, base );

	rawValue = ( u16 ) ( pHalData->MCSTxPowerLevelOriginalOffset[0][7] & 0xFF );
	base = ( rawValue >> 4 ) * 10 + ( rawValue & 0xF );
	PHY_SetTxPowerByRateBase( pAdapter, BAND_ON_2_4G, ODM_RF_PATH_B, CCK, RF_1TX, base );

	rawValue = ( u16 ) ( pHalData->MCSTxPowerLevelOriginalOffset[0][9] >> 24 ) & 0xFF;
	base = ( rawValue >> 4 ) * 10 + ( rawValue & 0xF );
	PHY_SetTxPowerByRateBase( pAdapter, BAND_ON_2_4G, ODM_RF_PATH_B, OFDM, RF_1TX, base );

	rawValue = ( u16 ) ( pHalData->MCSTxPowerLevelOriginalOffset[0][11] >> 24 ) & 0xFF;
	base = ( rawValue >> 4 ) * 10 + ( rawValue & 0xF );
	PHY_SetTxPowerByRateBase( pAdapter, BAND_ON_2_4G, ODM_RF_PATH_B, HT_MCS0_MCS7, RF_1TX, base );

	rawValue = ( u16 ) ( pHalData->MCSTxPowerLevelOriginalOffset[0][13] >> 24 ) & 0xFF;
	base = ( rawValue >> 4 ) * 10 + ( rawValue & 0xF );
	PHY_SetTxPowerByRateBase( pAdapter, BAND_ON_2_4G, ODM_RF_PATH_B, HT_MCS8_MCS15, RF_2TX, base );
}

VOID
PHY_StoreTxPowerByRateBase(
	IN	PADAPTER	pAdapter
	)
{
	u8	path = 0, base = 0, index = 0;

	//DBG_871X( "===>%s\n", __FUNCTION__ );

	for ( path = ODM_RF_PATH_A; path <= ODM_RF_PATH_B; ++path )
	{
		base = PHY_GetTxPowerByRate( pAdapter, BAND_ON_2_4G, path, RF_1TX, MGN_11M );
		PHY_SetTxPowerByRateBase( pAdapter, BAND_ON_2_4G, path, CCK, RF_1TX, base );
		//DBG_871X("Power index base of 2.4G path %d 1Tx CCK = > 0x%x", path, base );

		base = PHY_GetTxPowerByRate( pAdapter, BAND_ON_2_4G, path, RF_1TX, MGN_54M );
		PHY_SetTxPowerByRateBase( pAdapter, BAND_ON_2_4G, path, OFDM, RF_1TX, base );
		//DBG_871X("Power index base of 2.4G path %d 1Tx OFDM = > 0x%x", path, base );

		base = PHY_GetTxPowerByRate( pAdapter, BAND_ON_2_4G, path, RF_1TX, MGN_MCS7 );
		PHY_SetTxPowerByRateBase( pAdapter, BAND_ON_2_4G, path, HT_MCS0_MCS7, RF_1TX, base );
		//DBG_871X("Power index base of 2.4G path %d 1Tx MCS0-7 = > 0x%x", path, base );

		base = PHY_GetTxPowerByRate( pAdapter, BAND_ON_2_4G, path, RF_2TX, MGN_MCS15 );
		PHY_SetTxPowerByRateBase( pAdapter, BAND_ON_2_4G, path, HT_MCS8_MCS15, RF_2TX, base );
		//DBG_871X("Power index base of 2.4G path %d 2Tx MCS8-15 = > 0x%x", path, base );

		base = PHY_GetTxPowerByRate( pAdapter, BAND_ON_2_4G, path, RF_1TX, MGN_VHT1SS_MCS7 );
		PHY_SetTxPowerByRateBase( pAdapter, BAND_ON_2_4G, path, VHT_1SSMCS0_1SSMCS9, RF_1TX, base );
		//DBG_871X("Power index base of 2.4G path %d 1Tx VHT1SS = > 0x%x", path, base );

		base = PHY_GetTxPowerByRate( pAdapter, BAND_ON_2_4G, path, RF_2TX, MGN_VHT2SS_MCS7 );
		PHY_SetTxPowerByRateBase( pAdapter, BAND_ON_2_4G, path, VHT_2SSMCS0_2SSMCS9, RF_2TX, base );
		//DBG_871X("Power index base of 2.4G path %d 2Tx VHT2SS = > 0x%x", path, base );

		base = PHY_GetTxPowerByRate( pAdapter, BAND_ON_5G, path, RF_1TX, MGN_54M );
		PHY_SetTxPowerByRateBase( pAdapter, BAND_ON_5G, path, OFDM, RF_1TX, base );
		//DBG_871X("Power index base of 5G path %d 1Tx OFDM = > 0x%x", path, base );

		base = PHY_GetTxPowerByRate( pAdapter, BAND_ON_5G, path, RF_1TX, MGN_MCS7 );
		PHY_SetTxPowerByRateBase( pAdapter, BAND_ON_5G, path, HT_MCS0_MCS7, RF_1TX, base );
		//DBG_871X("Power index base of 5G path %d 1Tx MCS0~7 = > 0x%x", path, base );

		base = PHY_GetTxPowerByRate( pAdapter, BAND_ON_5G, path, RF_2TX, MGN_MCS15 );
		PHY_SetTxPowerByRateBase( pAdapter, BAND_ON_5G, path, HT_MCS8_MCS15, RF_2TX, base );
		//DBG_871X("Power index base of 5G path %d 1Tx MCS8~15 = > 0x%x", path, base );

		base = PHY_GetTxPowerByRate( pAdapter, BAND_ON_5G, path, RF_1TX, MGN_VHT1SS_MCS7 );
		PHY_SetTxPowerByRateBase( pAdapter, BAND_ON_5G, path, VHT_1SSMCS0_1SSMCS9, RF_1TX, base );
		//DBG_871X("Power index base of 5G path %d 1Tx VHT1SS = > 0x%x", path, base );

		base = PHY_GetTxPowerByRate( pAdapter, BAND_ON_5G, path, RF_2TX, MGN_VHT2SS_MCS7 );
		PHY_SetTxPowerByRateBase( pAdapter, BAND_ON_5G, path, VHT_2SSMCS0_2SSMCS9, RF_2TX, base );
		//DBG_871X("Power index base of 5G path %d 2Tx VHT2SS = > 0x%x", path, base );
	}

	//DBG_871X("<===%s\n", __FUNCTION__ );
}

u8
PHY_GetRateSectionIndexOfTxPowerByRate(
	IN	PADAPTER	pAdapter,
	IN	u32			RegAddr,
	IN	u32			BitMask
	)
{
	HAL_DATA_TYPE	*pHalData = GET_HAL_DATA( pAdapter );
	PDM_ODM_T		pDM_Odm = &pHalData->odmpriv;
	u8 			index = 0;

	if ( pDM_Odm->PhyRegPgVersion == 0 )
	{
		switch ( RegAddr )
		{
			case rTxAGC_A_Rate18_06:	 index = 0;		break;
			case rTxAGC_A_Rate54_24:	 index = 1;		break;
			case rTxAGC_A_CCK1_Mcs32:	 index = 6;		break;
			case rTxAGC_B_CCK11_A_CCK2_11:
				if ( BitMask == 0xffffff00 )
					index = 7;
				else if ( BitMask == 0x000000ff )
					index = 15;
				break;

			case rTxAGC_A_Mcs03_Mcs00:	 index = 2;		break;
			case rTxAGC_A_Mcs07_Mcs04:	 index = 3;		break;
			case rTxAGC_A_Mcs11_Mcs08:	 index = 4;		break;
			case rTxAGC_A_Mcs15_Mcs12:	 index = 5;		break;
			case rTxAGC_B_Rate18_06:	 index = 8;		break;
			case rTxAGC_B_Rate54_24:	 index = 9;		break;
			case rTxAGC_B_CCK1_55_Mcs32: index = 14;	break;
			case rTxAGC_B_Mcs03_Mcs00:	 index = 10;	break;
			case rTxAGC_B_Mcs07_Mcs04:	 index = 11;	break;
			case rTxAGC_B_Mcs11_Mcs08:	 index = 12;	break;
			case rTxAGC_B_Mcs15_Mcs12:	 index = 13;	break;
			default:
				DBG_871X("Invalid RegAddr 0x3%x in PHY_GetRateSectionIndexOfTxPowerByRate()", RegAddr );
				break;
		};
	}

	return index;
}

VOID
PHY_GetRateValuesOfTxPowerByRate(
	IN	PADAPTER	pAdapter,
	IN	u32			RegAddr,
	IN	u32			BitMask,
	IN	u32			Value,
	OUT	u8*			RateIndex,
	OUT	s8*			PwrByRateVal,
	OUT	u8*			RateNum
	)
{
	HAL_DATA_TYPE	*pHalData = GET_HAL_DATA( pAdapter );
	PDM_ODM_T		pDM_Odm = &pHalData->odmpriv;
	u8	 			index = 0, i = 0;

	switch ( RegAddr )
	{
		case rTxAGC_A_Rate18_06:
		case rTxAGC_B_Rate18_06:
			RateIndex[0] = PHY_GetRateIndexOfTxPowerByRate( MGN_6M );
			RateIndex[1] = PHY_GetRateIndexOfTxPowerByRate( MGN_9M );
			RateIndex[2] = PHY_GetRateIndexOfTxPowerByRate( MGN_12M );
			RateIndex[3] = PHY_GetRateIndexOfTxPowerByRate( MGN_18M );
			for ( i = 0; i < 4; ++ i )
			{
				PwrByRateVal[i] = ( s8 ) ( ( ( ( Value >> (i * 8 + 4) ) & 0xF ) ) * 10 +
												( ( Value >> (i * 8) ) & 0xF ) );
			}
			*RateNum = 4;
			break;

		case rTxAGC_A_Rate54_24:
		case rTxAGC_B_Rate54_24:
			RateIndex[0] = PHY_GetRateIndexOfTxPowerByRate( MGN_24M );
			RateIndex[1] = PHY_GetRateIndexOfTxPowerByRate( MGN_36M );
			RateIndex[2] = PHY_GetRateIndexOfTxPowerByRate( MGN_48M );
			RateIndex[3] = PHY_GetRateIndexOfTxPowerByRate( MGN_54M );
			for ( i = 0; i < 4; ++ i )
			{
				PwrByRateVal[i] = ( s8 ) ( ( ( ( Value >> (i * 8 + 4) ) & 0xF ) ) * 10 +
												( ( Value >> (i * 8) ) & 0xF ) );
			}
			*RateNum = 4;
			break;

		case rTxAGC_A_CCK1_Mcs32:
			RateIndex[0] = PHY_GetRateIndexOfTxPowerByRate( MGN_1M );
			PwrByRateVal[0] = ( s8 ) ( ( ( ( Value >> (8 + 4) ) & 0xF ) ) * 10 +
											( ( Value >> 8 ) & 0xF ) );
			*RateNum = 1;
			break;

		case rTxAGC_B_CCK11_A_CCK2_11:
			if ( BitMask == 0xffffff00 )
			{
				RateIndex[0] = PHY_GetRateIndexOfTxPowerByRate( MGN_2M );
				RateIndex[1] = PHY_GetRateIndexOfTxPowerByRate( MGN_5_5M );
				RateIndex[2] = PHY_GetRateIndexOfTxPowerByRate( MGN_11M );
				for ( i = 1; i < 4; ++ i )
				{
					PwrByRateVal[i - 1] = ( s8 ) ( ( ( ( Value >> (i * 8 + 4) ) & 0xF ) ) * 10 +
													( ( Value >> (i * 8) ) & 0xF ) );
				}
				*RateNum = 3;
			}
			else if ( BitMask == 0x000000ff )
			{
				RateIndex[0] = PHY_GetRateIndexOfTxPowerByRate( MGN_11M );
				PwrByRateVal[0] = ( s8 ) ( ( ( ( Value >> 4 ) & 0xF ) ) * 10 +
											        ( Value & 0xF ) );
				*RateNum = 1;
			}
			break;

