thypon/bowser-kernel/drivers/net/wireless/rtl8723bs/hal/hal_com_phycfg.c
		case rTxAGC_A_Mcs03_Mcs00:
		case rTxAGC_B_Mcs03_Mcs00:
			RateIndex[0] = PHY_GetRateIndexOfTxPowerByRate( MGN_MCS0 );
			RateIndex[1] = PHY_GetRateIndexOfTxPowerByRate( MGN_MCS1 );
			RateIndex[2] = PHY_GetRateIndexOfTxPowerByRate( MGN_MCS2 );
			RateIndex[3] = PHY_GetRateIndexOfTxPowerByRate( MGN_MCS3 );
			for ( i = 0; i < 4; ++ i )
			{
				PwrByRateVal[i] = ( s8 ) ( ( ( ( Value >> (i * 8 + 4) ) & 0xF ) ) * 10 +
												( ( Value >> (i * 8) ) & 0xF ) );
			}
			*RateNum = 4;
			break;

		case rTxAGC_A_Mcs07_Mcs04:
		case rTxAGC_B_Mcs07_Mcs04:
			RateIndex[0] = PHY_GetRateIndexOfTxPowerByRate( MGN_MCS4 );
			RateIndex[1] = PHY_GetRateIndexOfTxPowerByRate( MGN_MCS5 );
			RateIndex[2] = PHY_GetRateIndexOfTxPowerByRate( MGN_MCS6 );
			RateIndex[3] = PHY_GetRateIndexOfTxPowerByRate( MGN_MCS7 );
			for ( i = 0; i < 4; ++ i )
			{
				PwrByRateVal[i] = ( s8 ) ( ( ( ( Value >> (i * 8 + 4) ) & 0xF ) ) * 10 +
												( ( Value >> (i * 8) ) & 0xF ) );
			}
			*RateNum = 4;
			break;

		case rTxAGC_A_Mcs11_Mcs08:
		case rTxAGC_B_Mcs11_Mcs08:
			RateIndex[0] = PHY_GetRateIndexOfTxPowerByRate( MGN_MCS8 );
			RateIndex[1] = PHY_GetRateIndexOfTxPowerByRate( MGN_MCS9 );
			RateIndex[2] = PHY_GetRateIndexOfTxPowerByRate( MGN_MCS10 );
			RateIndex[3] = PHY_GetRateIndexOfTxPowerByRate( MGN_MCS11 );
			for ( i = 0; i < 4; ++ i )
			{
				PwrByRateVal[i] = ( s8 ) ( ( ( ( Value >> (i * 8 + 4) ) & 0xF ) ) * 10 +
												( ( Value >> (i * 8) ) & 0xF ) );
			}
			*RateNum = 4;
			break;

		case rTxAGC_A_Mcs15_Mcs12:
		case rTxAGC_B_Mcs15_Mcs12:
			RateIndex[0] = PHY_GetRateIndexOfTxPowerByRate( MGN_MCS12 );
			RateIndex[1] = PHY_GetRateIndexOfTxPowerByRate( MGN_MCS13 );
			RateIndex[2] = PHY_GetRateIndexOfTxPowerByRate( MGN_MCS14 );
			RateIndex[3] = PHY_GetRateIndexOfTxPowerByRate( MGN_MCS15 );
			for ( i = 0; i < 4; ++ i )
			{
				PwrByRateVal[i] = ( s8 ) ( ( ( ( Value >> (i * 8 + 4) ) & 0xF ) ) * 10 +
												( ( Value >> (i * 8) ) & 0xF ) );
			}
			*RateNum = 4;

			break;

		case rTxAGC_B_CCK1_55_Mcs32:
			RateIndex[0] = PHY_GetRateIndexOfTxPowerByRate( MGN_1M );
			RateIndex[1] = PHY_GetRateIndexOfTxPowerByRate( MGN_2M );
			RateIndex[2] = PHY_GetRateIndexOfTxPowerByRate( MGN_5_5M );
			for ( i = 1; i < 4; ++ i )
			{
				PwrByRateVal[i - 1] = ( s8 ) ( ( ( ( Value >> ( i * 8 + 4) ) & 0xF ) ) * 10 +
												( ( Value >> ( i * 8) ) & 0xF ) );
			}
			*RateNum = 3;
			break;

		default:
			RegAddr =  ( RegAddr & 0xFFF );
			if ( RegAddr >= 0xC20 && RegAddr <= 0xC4C )
			{
				for ( i = 0; i < 4; ++i )
				{
					RateIndex[i] = ( u8 ) ( ( RegAddr - 0xC20 ) + i );
					PwrByRateVal[i] = ( s8 ) ( ( ( Value >> (i * 8 + 4) ) & 0xF ) * 10 +
												    ( ( Value >> (i * 8) ) & 0xF ) );
				}
				*RateNum = 4;
			}
			else if ( RegAddr >= 0xE20 && RegAddr <= 0xE4C )
			{
				for ( i = 0; i < 4; ++i )
				{
					RateIndex[i] = ( u8 ) ( ( RegAddr - 0xE20 ) + i );
					PwrByRateVal[i] = ( s8 ) ( ( ( Value >> (i * 8 + 4) ) & 0xF ) * 10 +
												    ( ( Value >> (i * 8) ) & 0xF ) );
				}
				*RateNum = 4;
			}
			else
			{
				DBG_871X( "Invalid RegAddr 0x%x in PHY_GetRateSectionIndexOfTxPowerByRate()\n", RegAddr);
			}
			break;
	};
}

void
PHY_StoreTxPowerByRateNew(
	IN	PADAPTER	pAdapter,
	IN	u32			Band,
	IN	u32			RfPath,
	IN	u32			TxNum,
	IN	u32			RegAddr,
	IN	u32			BitMask,
	IN	u32			Data
	)
{
	HAL_DATA_TYPE	*pHalData	= GET_HAL_DATA(pAdapter);
	u8	i = 0, rateIndex[4] = {0}, rateNum = 0;
	s8	PwrByRateVal[4] = {0};

	PHY_GetRateValuesOfTxPowerByRate( pAdapter, RegAddr, BitMask, Data, rateIndex, PwrByRateVal, &rateNum );

	if ( Band != BAND_ON_2_4G && Band != BAND_ON_5G )
	{
		DBG_871X("Invalid Band %d\n", Band );
	}

	if ( RfPath > ODM_RF_PATH_MAX )
	{
		DBG_871X("Invalid RfPath %d\n", RfPath );
	}

	if ( TxNum > ODM_RF_PATH_MAX )
	{
		DBG_871X("Invalid TxNum %d\n", TxNum );
	}

	for ( i = 0; i < rateNum; ++i )
	{
		if ( rateIndex[i] == PHY_GetRateIndexOfTxPowerByRate( MGN_VHT2SS_MCS0) ||
			 rateIndex[i] == PHY_GetRateIndexOfTxPowerByRate( MGN_VHT2SS_MCS1) )
		{
			TxNum = RF_2TX;
		}

		pHalData->TxPwrByRateOffset[Band][RfPath][TxNum][rateIndex[i]] = PwrByRateVal[i];
	}
}

void
PHY_StoreTxPowerByRateOld(
	IN	PADAPTER		pAdapter,
	IN	u32				RegAddr,
	IN	u32				BitMask,
	IN	u32				Data
	)
{
	HAL_DATA_TYPE	*pHalData = GET_HAL_DATA(pAdapter);
	u8			index = PHY_GetRateSectionIndexOfTxPowerByRate( pAdapter, RegAddr, BitMask );

	pHalData->MCSTxPowerLevelOriginalOffset[pHalData->pwrGroupCnt][index] = Data;
	//DBG_871X("MCSTxPowerLevelOriginalOffset[%d][0] = 0x%x\n", pHalData->pwrGroupCnt,
	//	pHalData->MCSTxPowerLevelOriginalOffset[pHalData->pwrGroupCnt][0]);
}

VOID
PHY_InitTxPowerByRate(
	IN	PADAPTER	pAdapter
	)
{
	HAL_DATA_TYPE	*pHalData = GET_HAL_DATA(pAdapter);
	u8	band = 0, rfPath = 0, TxNum = 0, rate = 0, i = 0, j = 0;

	if ( IS_HARDWARE_TYPE_8188E( pAdapter ) || IS_HARDWARE_TYPE_8723A( pAdapter ) )
	{
		for ( i = 0; i < MAX_PG_GROUP; ++i )
			for ( j = 0; j < 16; ++j )
				pHalData->MCSTxPowerLevelOriginalOffset[i][j] = 0;
	}
	else
	{
		for ( band = BAND_ON_2_4G; band <= BAND_ON_5G; ++band )
				for ( rfPath = 0; rfPath < TX_PWR_BY_RATE_NUM_RF; ++rfPath )
					for ( TxNum = 0; TxNum < TX_PWR_BY_RATE_NUM_RF; ++TxNum )
						for ( rate = 0; rate < TX_PWR_BY_RATE_NUM; ++rate )
							pHalData->TxPwrByRateOffset[band][rfPath][TxNum][rate] = 0;
	}
}

VOID
PHY_StoreTxPowerByRate(
	IN	PADAPTER	pAdapter,
	IN	u32			Band,
	IN	u32			RfPath,
	IN	u32			TxNum,
	IN	u32			RegAddr,
	IN	u32			BitMask,
	IN	u32			Data
	)
{
	HAL_DATA_TYPE	*pHalData = GET_HAL_DATA(pAdapter);
	PDM_ODM_T  		pDM_Odm = &pHalData->odmpriv;

	if ( pDM_Odm->PhyRegPgVersion > 0 )
	{
		PHY_StoreTxPowerByRateNew( pAdapter, Band, RfPath, TxNum, RegAddr, BitMask, Data );
	}
	else if ( pDM_Odm->PhyRegPgVersion == 0 )
	{
		PHY_StoreTxPowerByRateOld( pAdapter, RegAddr, BitMask, Data );

		if ( RegAddr == rTxAGC_A_Mcs15_Mcs12 && pHalData->rf_type == RF_1T1R )
			pHalData->pwrGroupCnt++;
		else if ( RegAddr == rTxAGC_B_Mcs15_Mcs12 && pHalData->rf_type != RF_1T1R )
			pHalData->pwrGroupCnt++;
	}
	else
		DBG_871X("Invalid PHY_REG_PG.txt version %d\n",  pDM_Odm->PhyRegPgVersion );

