thypon/bowser-kernel/drivers/net/wireless/rtl8723bs/hal/hal_com_phycfg.c
		powerLimit = (regulation == TXPWR_LMT_WW) ? phy_GetWorldWideLimit(limits) :
			          pHalData->TxPwrLimit_2_4G[regulation][bandwidth][rateSection][channel][RfPath];

	} else if ( Band == BAND_ON_5G ) {
		s8 limits[10] = {0}; u8 i = 0;
		for (i = 0; i < MAX_REGULATION_NUM; ++i)
			limits[i] = pHalData->TxPwrLimit_5G[i][bandwidth][rateSection][channel][RfPath];

		powerLimit = (regulation == TXPWR_LMT_WW) ? phy_GetWorldWideLimit(limits) :
					  pHalData->TxPwrLimit_5G[regulation][bandwidth][rateSection][channel][RfPath];
	} else
		DBG_871X("No power limit table of the specified band\n" );

	// combine 5G VHT & HT rate
	// 5G 20M and 40M HT and VHT can cross reference
	/*
	if ( Band == BAND_ON_5G && powerLimit == MAX_POWER_INDEX ) {
		if ( bandwidth == 0 || bandwidth == 1 ) {
			RT_TRACE( COMP_INIT, DBG_LOUD, ( "No power limit table of the specified band %d, bandwidth %d, ratesection %d, rf path %d\n",
					  band, bandwidth, rateSection, RfPath ) );
			if ( rateSection == 2 )
				powerLimit = pHalData->TxPwrLimit_5G[regulation]
										[bandwidth][4][channelGroup][RfPath];
			else if ( rateSection == 4 )
				powerLimit = pHalData->TxPwrLimit_5G[regulation]
										[bandwidth][2][channelGroup][RfPath];
			else if ( rateSection == 3 )
				powerLimit = pHalData->TxPwrLimit_5G[regulation]
										[bandwidth][5][channelGroup][RfPath];
			else if ( rateSection == 5 )
				powerLimit = pHalData->TxPwrLimit_5G[regulation]
										[bandwidth][3][channelGroup][RfPath];
		}
	}
	*/
	//DBG_871X("TxPwrLmt[Regulation %d][Band %d][BW %d][RFPath %d][Rate 0x%x][Chnl %d] = %d\n",
	//		regulation, pHalData->CurrentBandType, Bandwidth, RfPath, DataRate, Channel, powerLimit);
	return powerLimit;
}

VOID
phy_CrossReferenceHTAndVHTTxPowerLimit(
	IN	PADAPTER			pAdapter
	)
{
	HAL_DATA_TYPE		*pHalData = GET_HAL_DATA(pAdapter);
	u8 				regulation, bw, channel, rateSection;
	s8 				tempPwrLmt = 0;

	for ( regulation = 0; regulation < MAX_REGULATION_NUM; ++regulation )
	{
		for ( bw = 0; bw < MAX_5G_BANDWITH_NUM; ++bw )
		{
			for ( channel = 0; channel < CHANNEL_MAX_NUMBER_5G; ++channel )
			{
				for ( rateSection = 0; rateSection < MAX_RATE_SECTION_NUM; ++rateSection )
				{
					tempPwrLmt = pHalData->TxPwrLimit_5G[regulation][bw][rateSection][channel][ODM_RF_PATH_A];
					if ( tempPwrLmt == MAX_POWER_INDEX )
					{
						if ( bw == 0 || bw == 1 ) { // 5G 20M 40M VHT and HT can cross reference
							//DBG_871X("No power limit table of the specified band %d, bandwidth %d, ratesection %d, channel %d, rf path %d\n",
							//			1, bw, rateSection, channel, ODM_RF_PATH_A );
							if ( rateSection == 2 ) {
								pHalData->TxPwrLimit_5G[regulation][bw][2][channel][ODM_RF_PATH_A] =
									pHalData->TxPwrLimit_5G[regulation][bw][4][channel][ODM_RF_PATH_A];
							}
							else if ( rateSection == 4 ) {
								pHalData->TxPwrLimit_5G[regulation][bw][4][channel][ODM_RF_PATH_A] =
									pHalData->TxPwrLimit_5G[regulation][bw][2][channel][ODM_RF_PATH_A];
							}
							else if ( rateSection == 3 ) {
								pHalData->TxPwrLimit_5G[regulation][bw][3][channel][ODM_RF_PATH_A] =
									pHalData->TxPwrLimit_5G[regulation][bw][5][channel][ODM_RF_PATH_A];
							}
							else if ( rateSection == 5 ) {
								pHalData->TxPwrLimit_5G[regulation][bw][5][channel][ODM_RF_PATH_A] =
									pHalData->TxPwrLimit_5G[regulation][bw][3][channel][ODM_RF_PATH_A];
							}

							//DBG_871X("use other value %d", tempPwrLmt );
						}
					}
				}
			}
		}
	}
}

VOID
PHY_ConvertTxPowerLimitToPowerIndex(
	IN	PADAPTER			Adapter
	)
{
	HAL_DATA_TYPE		*pHalData = GET_HAL_DATA(Adapter);
	u8 				BW40PwrBasedBm2_4G, BW40PwrBasedBm5G;
	u8 				regulation, bw, channel, rateSection;
	u8 				baseIndex2_4G;
	u8				baseIndex5G;
	s8 				tempValue = 0, tempPwrLmt = 0;
	u8 				rfPath = 0;

	//DBG_871X("=====> PHY_ConvertTxPowerLimitToPowerIndex()\n" );

	phy_CrossReferenceHTAndVHTTxPowerLimit( Adapter );

	for ( regulation = 0; regulation < MAX_REGULATION_NUM; ++regulation )
	{
		for ( bw = 0; bw < MAX_2_4G_BANDWITH_NUM; ++bw )
		{
			for ( channel = 0; channel < CHANNEL_MAX_NUMBER_2G; ++channel )
			{
				for ( rateSection = 0; rateSection < MAX_RATE_SECTION_NUM; ++rateSection )
				{
					baseIndex2_4G = 0;
					if ( pHalData->odmpriv.PhyRegPgValueType == PHY_REG_PG_EXACT_VALUE ) {
						// obtain the base dBm values in 2.4G band
						// CCK => 11M, OFDM => 54M, HT 1T => MCS7, HT 2T => MCS15
						if ( rateSection == 0 ) { //CCK
							baseIndex2_4G = PHY_GetTxPowerByRateBaseIndex( BAND_ON_2_4G, MGN_11M );
						}
						else if ( rateSection == 1 ) { //OFDM
							baseIndex2_4G = PHY_GetTxPowerByRateBaseIndex( BAND_ON_2_4G, MGN_54M );
						}
						else if ( rateSection == 2 ) { //HT IT
							baseIndex2_4G = PHY_GetTxPowerByRateBaseIndex( BAND_ON_2_4G, MGN_MCS7 );
						}
						else if ( rateSection == 3 ) { //HT 2T
							baseIndex2_4G = PHY_GetTxPowerByRateBaseIndex( BAND_ON_2_4G, MGN_MCS15 );
						}
					}

					tempPwrLmt = pHalData->TxPwrLimit_2_4G[regulation][bw][rateSection][channel][ODM_RF_PATH_A];

					for ( rfPath = ODM_RF_PATH_A; rfPath < MAX_RF_PATH_NUM; ++rfPath )
					{
						if ( pHalData->odmpriv.PhyRegPgValueType == PHY_REG_PG_EXACT_VALUE )
						{
							if ( rateSection == 3 )
								BW40PwrBasedBm2_4G = pHalData->TxPwrByRateBase2_4G[rfPath][RF_2TX][baseIndex2_4G];
							else
								BW40PwrBasedBm2_4G = pHalData->TxPwrByRateBase2_4G[rfPath][RF_1TX][baseIndex2_4G];
						}
						else
							BW40PwrBasedBm2_4G = Adapter->registrypriv.RegPowerBase * 2;

						if ( tempPwrLmt != MAX_POWER_INDEX ) {
							tempValue = tempPwrLmt - BW40PwrBasedBm2_4G;
							pHalData->TxPwrLimit_2_4G[regulation][bw][rateSection][channel][rfPath] = tempValue;
						}
					}
				}
			}
		}
	}

	if ( IS_HARDWARE_TYPE_8812( Adapter ) || IS_HARDWARE_TYPE_8821( Adapter ) )
	{
		for ( regulation = 0; regulation < MAX_REGULATION_NUM; ++regulation )
		{
			for ( bw = 0; bw < MAX_5G_BANDWITH_NUM; ++bw )
			{
				for ( channel = 0; channel < CHANNEL_MAX_NUMBER_5G; ++channel )
				{
					for ( rateSection = 0; rateSection < MAX_RATE_SECTION_NUM; ++rateSection )
					{
						baseIndex5G = 0;
						if ( pHalData->odmpriv.PhyRegPgValueType == PHY_REG_PG_EXACT_VALUE ) {
							// obtain the base dBm values in 5G band
							// OFDM => 54M, HT 1T => MCS7, HT 2T => MCS15,
							// VHT => 1SSMCS7, VHT 2T => 2SSMCS7
							if ( rateSection == 1 ) { //OFDM
								baseIndex5G = PHY_GetTxPowerByRateBaseIndex( BAND_ON_5G, MGN_54M );
							}
							else if ( rateSection == 2 ) { //HT 1T
								baseIndex5G = PHY_GetTxPowerByRateBaseIndex( BAND_ON_5G, MGN_MCS7 );
							}
							else if ( rateSection == 3 ) { //HT 2T
								baseIndex5G = PHY_GetTxPowerByRateBaseIndex( BAND_ON_5G, MGN_MCS15 );
							}
							else if ( rateSection == 4 ) { //VHT 1T
								baseIndex5G = PHY_GetTxPowerByRateBaseIndex( BAND_ON_5G, MGN_VHT1SS_MCS7 );
							}
							else if ( rateSection == 5 ) { //VHT 2T
								baseIndex5G = PHY_GetTxPowerByRateBaseIndex( BAND_ON_5G, MGN_VHT2SS_MCS7 );
							}
						}

